In [40]:
# EJERCICIO 1

# """
#     Cada número es la suma de los 2 anteriores:
#     0-1-1-2-3-5-8-13-21-34...
#     Se pide programar esa secuencia con Python.
#     Nota:
#     Apendiza elementos hasta tener 10 primeros resultados.
#     (los 10 números indicados desde 0 hasta 34)
#     Si sabes, hazlo de varias formas diferentes
# """

import pandas as pd
import numpy as np

In [68]:
def Fibonacci(num):
    
    listado_fibo = []
    anterior=0
    numero= 1
    listado_fibo.append(anterior)
    listado_fibo.append(numero)

    valor=0 

    while len(listado_fibo)<num:
        valor = numero + anterior    
        listado_fibo.append(valor)
        anterior = numero
        numero = valor

    return listado_fibo

Fibonacci(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [1]:
L = [0, 1]
i=0
while (len(L) < 10):
    L.append(L[-1] + L[-2])
L

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [ ]:
# EJERCICIO 2

# Cada número es la suma de los 2 anteriores:

# 0-1-1-2-3-5-8-13-21-34...

# Se pide programar para los números de fibonacci mayores de 1000

# Primero muestra los valores de 0 hasta 1000000, crea una lista
# con ese listado crea una segunda lista con los mayores de 1000

In [14]:
L = [0, 1]
i=0
while (len(L) < 100):
    L.append(L[-1] + L[-2])

In [15]:
L2= []  
for i in L:
    if (i > 1000) and (len(L2)<10):
        L2.append(i)
L2

[1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393]

In [80]:
L3 =Fibonacci(100)

def Fibonacci_mayores(lista,numero, maximo):
    L4 = []
    for i in lista:
        if (i > numero) and (len(L4)<maximo):
            L4.append(i)
    return L4  

Fibonacci_mayores(L3,1000,10)

[1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393]

In [72]:
L4 = []
for i in L3:
    if (i > 1000) and (len(L4)<10):
        L4.append(i)
L4

[1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393]

In [16]:
# EJERCICIO 3

# Se pide crear un NUEVO dataframe para cada uno de los siguientes casos

# planteados y que están relacionados con el Titanic DataSet

# (antes debéis de cargar el archivo como df)

# 1) Leer el archivo train.csv del titanic dataset

#df = pd.read_csv("./src/train.csv")

# Descomentar para ejecutar:
# print(df)

# 2) Crear un dataframe de nombre df_sobreviven refiriéndose a un dataframe en el que todos los pasajeros sobreviven

    # NOTA: si al principio no estás seguro del resultado, puedes usar value_counts() para comprobar tu resultado

# 3) Crear un dataframe de nombre df__no_sobreviven refiriéndose a un dataframe en el que NINGUNO de los pasajeros sobrevive

# 4) DataFrame de hombres que no sobrevivieron en el titanic

# 5) DataFrame de hombres que si sobrevivieron en el titanic

# 6) DataFrame de mujeres que no sobrevivieron en el titanic

# 7) DataFrame de mujeres que si sobrevivieron en el titanic

In [21]:
import pandas as pd

In [150]:
df = pd.read_csv("train.csv")

print(df)

len(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

891

In [124]:
# 2) Crear un dataframe de nombre df_sobreviven refiriéndose a un dataframe en el que todos los pasajeros sobreviven

    # NOTA: si al principio no estás seguro del resultado, puedes usar value_counts() para comprobar tu resultado

df_sobreviven = df[df["Survived"]==1]

len(df_sobreviven)

342

In [151]:
def supervivientes(df, valor):
    return df[df["Survived"]==valor]

df_sobreviven = supervivientes(df, 1)

print("Sobreviven", len(df_sobreviven))

Sobreviven 342

In [152]:
# 3) Crear un dataframe de nombre df__no_sobreviven refiriéndose a un dataframe en el que NINGUNO de los pasajeros sobrevive
# df_no_sobreviven = df[df["Survived"]==0]

# df_no_sobreviven.head()

df_no_sobreviven = supervivientes(df, 0)

print("No sobreviven", len(df_no_sobreviven))

No sobreviven 549

In [143]:
# 4) DataFrame de hombres que no sobrevivieron en el titanic
df_hombre_no_sobreviven = df[(df["Survived"]==0) & (df["Sex"]=="male")]
                        
df_hombre_no_sobreviven.head()

len(df_hombre_no_sobreviven)

468

In [155]:
def filtado_sexo (lista, sexo):
    return lista[lista["Sex"] == sexo]


df_hombre_no_sobreviven = filtado_sexo(df_no_sobreviven, "male")

print("Hombres que no sobreviven", len(df_hombre_no_sobreviven))

Hombres que no sobreviven 468

In [36]:
# 5) DataFrame de hombres que si sobrevivieron en el titanic
df_hombre_si_sobreviven = df[(df["Survived"]==1) & (df["Sex"]=="male")]
                        
df_hombre_si_sobreviven.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S

In [156]:
df_hombre_si_sobreviven = filtado_sexo (df_sobreviven, "male")

print("Hombres que sobreviven", len(df_hombre_si_sobreviven))

Hombres que sobreviven 109

In [37]:
# 6) DataFrame de mujeres que no sobrevivieron en el titanic
df_mujeres_no_sobreviven = df[(df["Survived"]==0) & (df["Sex"]=="female")]
                        
df_mujeres_no_sobreviven.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
38,39,0,3,"Vander Planke, Miss. Augusta Maria",female,18.0,2,0,345764,18.0000,NaN,S
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S

In [157]:
df_mujeres_no_sobreviven = filtado_sexo (df_no_sobreviven, "female")

print("Mujeres que sobreviven", len(df_mujeres_no_sobreviven))

Mujeres que sobreviven 81

In [137]:
# 7) DataFrame de mujeres que si sobrevivieron en el titanic
df_mujeres_si_sobreviven = df[(df["Survived"]==1) & (df["Sex"]=="female")]
                        
len(df_mujeres_si_sobreviven)

233

In [158]:
df_mujeres_si_sobreviven = filtado_sexo (df_sobreviven, "female")

print("Mujeres que sobreviven", len(df_mujeres_si_sobreviven))

Mujeres que sobreviven 233